// const numbers = [108, 4, 130, 34, 124, 11, 144, 85, 82, 80, 123, 25, 128, 78, 36, 30, 90, 23, 84, 147, 143, 18, 62, 96, 63, 129, 15, 109, 52, 119, 138, 65, 18, 135, 69, 89, 13, 70, 109, 22];

// every
// בודק האם כל הפרמטרים שבמערך עונים על התנאי
numbers.every(x => x > 10);

// some
// בודק האם לפחות אבר אחד עונה על התנאי
numbers.some(x => x > 10);

// filter
// מחזיר מערך מסונן ע"פ התנאי המבוקש
numbers.filter(x => x > 10);

// find
// מחזיר את האבר *הראשון* ע"פ התנאי המבוקש
numbers.find(x => x > 36);

// findIndex
// מחזיר את האינדקס של האבר *הראשון* ע"פ התנאי המבוקש
numbers.findIndex(x => x == 36);

// flat
// משטח את כל המערכים הפנימיים למערך אחד
numbers.flat();

// map
// מחזיר מערך שונה ע"פ התנאי
numbers.map(x => x * 10);

// reduce
// מחזיר תוצאה של חישוב שנעשה על כל המערך
numbers.reduce((res, x) => res += x, 0);

// fill
// מחליף את כל האברים שבמערך לפרמטר המבוקש
// numbers.fill(80); // שמנו את הפונקציה כהערה ע"מ לא ליצור נזקים